
## Plan Result

[CI link](https://github.com/thaim-sandbox/sample-terraform-aws/actions/runs/18687976446)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_s3_bucket.tfcmt_sample
  * aws_s3_bucket_versioning.tfcmt_sample


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.tfcmt_sample will be created
  + resource "aws_s3_bucket" "tfcmt_sample" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "test"
          + "Name"        = "tfcmt-sample"
          + "repo"        = "thaim-sandbox/sample-terraform-aws"
        }
      + tags_all                    = {
          + "Environment" = "test"
          + "Name"        = "tfcmt-sample"
          + "repo"        = "thaim-sandbox/sample-terraform-aws"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_versioning.tfcmt_sample will be created
  + resource "aws_s3_bucket_versioning" "tfcmt_sample" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn  = (known after apply)
  + bucket_name = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"a81473784f1ca00e211aac33945804dbe18763c2","Vars":{},"WorkflowName":"Terraform Plan with tfcmt"} -->